[{"Deadline: ": "December 01, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Wittenberg University", "Website: ": "http://www.wittenberg.edu/admission/financials/witt_scholarships.html", "title": "Wittenberg Legacy Scholarship", "id": 168453, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "Unspecified", "Amount: ": "$18,450", "Description: ": "The Wittenberg Legacy Scholarship is available to students at Wittenberg University.  You must be the child or grandchild of a Wittenberg graduate to be eligible for this award."}, {"Deadline: ": "September 30, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Tipton County Community Foundation", "Website: ": "http://www.tiptoncf.org/scholarships.htm", "title": "Lilly Endowment Community Scholarship", "id": 168461, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "Unspecified", "Amount: ": "100% of tuition", "Description: ": "The Lilly Endowment Community Scholarship is available to graduating high school seniors residing in Tipton County.  You must be planning to attend an Indiana college or university to be eligible for this award."}, {"Deadline: ": "October 17, 2016", "Type of Award: ": "Promotion", "Provided By: ": "Dr Pepper", "Website: ": "https://ad.doubleclick.net/ddm/clk/308770293;135393056;j", "title": "Dr Pepper Tuition Giveaway", "id": 168494, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "4", "Amount: ": "$100,000", "Description: ": "Dr Pepper is awarding over $1,000,000 in tuition to help students reach their biggest goals.  The Dr Pepper Tuition Giveaway has changed lives by awarding over $8 million dollars in tuition since 2008.  With the challenges of rising tuition costs and studying full-time, Dr Pepper takes pride in helping students achieve their goals.  If you’re a student between the ages of 18-24, you can enter for the chance to win up to $100,000 in tuition.  Tell Dr Pepper how you’ll change the world in 350 characters or less, then rally your friends to vote.  Once you reach 50 votes, submit a video to inspire more fans.  Dr Pepper will select finalists to compete during throw-offs at college football conference championship games for a chance to win up to $100,000 in tuition.  NO PURCHASE NECESSARY. Internet, Email & Facebook account required. Must be a U.S. legal resident. Go to sponsor’s site to enter/upload goal/rules/details. Subject to full Official Rules. Void where prohibited. Must be 18-24 by 12/2/16.  Goals must be uploaded by and promotion ends 10/17/16.  ANY FUNDS NOT USED BY DECEMBER 31, 2021 WILL BE FORFEITED AND RETURNED TO SPONSOR.  DR PEPPER and DR PEPPER TEN are registered trademarks of Dr Pepper/Seven Up, Inc. ©2016 Dr Pepper/Seven Up, Inc."}, {"Deadline: ": "November 21, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "American Soybean Association", "Website: ": "", "title": "Soy Scholarship", "id": 168507, "Fields of Study: ": "Agriculture", "Awards Available: ": "1", "Amount: ": "$5,000", "Description: ": "The Soy Scholarship is open to high school seniors who are planning to pursue a degree in agriculture.  You must have a minimum GPA of 3.0, submit an essay of no more than 500 words on \"What roll will I play in the future of agriculture\", and be the child or grandchild of a current ASA member in order to be considered for this award."}, {"Deadline: ": "September 30, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Total Landscape Care", "Website: ": "", "title": "Total Landscape Care Scholarship Contest", "id": 168508, "Fields of Study: ": "Landscaping, Horticulture", "Awards Available: ": "3", "Amount: ": "$3,000", "Description: ": "The Total Landscape Care Scholarship Contest is open to students planning a career in landscaping and/or majoring in a related discipline.  You must submit a short essay and be at least 18 years of age in order to be considered for this award."}, {"Deadline: ": "March 01, 2017", "Type of Award: ": "Contest", "Provided By: ": "Each Mind Matters", "Website: ": "", "title": "Directing Change Student Film Contest", "id": 168509, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "3", "Amount: ": "Up to $500", "Description: ": "The Directing Change Student Film Contest is open to students between the ages of 14 and 25.  You must submit a film of no more than 60 seconds related to mental health and/or suicide prevention in order to be considered for this award. "}, {"Deadline: ": "November 04, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Student Veterans Of America   ", "Website: ": "http://studentveterans.org/programs/scholarships?layout=edit&id=605", "title": "Eli Lilly and Company Student Veterans Scholarship", "id": 168510, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "1", "Amount: ": "$10,000", "Description: ": "The Eli Lilly and Company Student Veterans Scholarship is open to college students of sophomore or junior standing.  You must have a minimum GPA of 3.0, demonstrated commitment to your chosen field of study and be a current student veteran in order to qualify for this award."}, {"Deadline: ": "December 15, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Creative Safety Supply", "Website: ": "", "title": "Creative Safety Supply Scholarship", "id": 168511, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "1", "Amount: ": "$1,000", "Description: ": "The Creative Safety Supply Scholarship is open to current college students.  You must have a minimum GPA of 3.0, be a citizen of the U.S. and submit an essay in order to be considered for this award."}, {"Deadline: ": "May 15, 2017", "Type of Award: ": "Scholarship", "Provided By: ": "Audio Engineering Society Educational Foundation", "Website: ": "", "title": "Larry Estrin AESEF Scholarship", "id": 168521, "Fields of Study: ": "Audio Engineering", "Awards Available: ": "1", "Amount: ": "$5,000", "Description: ": "The Larry Estrin AESEF Scholarship is available to graduate students who are members of AES.  You must demonstrate commitment to audio engineering in the broadcast industry or related field with advanced studies in RF technology or communications and broadcast production in order to be considered for this award."}, {"Deadline: ": "September 30, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Get Up! Get Active", "Website: ": "", "title": "Active Life Scholarship for Financial Literacy", "id": 168522, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "1", "Amount: ": "$1,000", "Description: ": "The Active Life Scholarship for Financial Literacy is open to college, graduate and adult learners.  You must submit a short statement on financial literacy in order to be considered for this award."}, {"Deadline: ": "October 31, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Get Up! Get Active", "Website: ": "", "title": "Active Life Scholarship to Tackle Your Weakness", "id": 168524, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "1", "Amount: ": "$1,000", "Description: ": "The Active Life Scholarship to Tackle Your Weakness is open to current high school and college students who are at least 15 years of age.  You must submit a short statement on what you consider your weakness or how to improve upon a weakness in order to be considered for this award."}, {"Deadline: ": "October 19, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Power Poetry", "Website: ": "http://s.bl-1.com/h/3LjrxDy?url=http://www.powerpoetry.org/poetry-slams/greet-day-scholarship-slam", "title": "Greet the Day Scholarship Slam", "id": 168529, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "1", "Amount: ": "$500", "Description: ": "Okay, so you might not be so excited about waking up early every day for school, but you do have that main reason to get up in the morning (besides waffles). There’s something that motivates you to roll out of bed and take on the day ahead.  What makes you get up and greet the day?  We want to know what makes you excited to experience each and every day. Do you seek out adventure? Love talking with your friends? Or maybe you just can’t wait to read the next chapter of that book. Tell us in a poem about what acts as your personal motivation for your chance to win.  This scholarship is merit based and your poem will be judged on quality, effort, creativity and content.\r\n\r\n\r\n\r\n\r\n\r\n\r\n"}, {"Deadline: ": "October 19, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Power Poetry", "Website: ": "http://s.bl-1.com/h/3LjrMC8?url=http://www.powerpoetry.org/poetry-slams/feelin-good-scholarship-slam", "title": "Feelin' Good Scholarship Slam", "id": 168530, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "1", "Amount: ": "$500", "Description: ": "Let’s face it: life can be tough. Sometimes things just don’t work out like we want them to. But when life gets us down, we all have something we turn to that makes us feel better without fail. What makes you feel good?  We want to know what your pick-me-up is. Do you read a certain poem? Chow down on some pizza? Cuddle your furry best friend? Tell us in a poem what makes you smile and why, for your chance to win.  \r\n\r\n\r\n\r\n\r\n\r\n\r\n"}, {"Deadline: ": "December 31, 2016", "Type of Award: ": "Contest", "Provided By: ": "Blue Mountain Arts", "Website: ": "", "title": "Poetry Card Contest", "id": 168541, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "3", "Amount: ": "Up to $300", "Description: ": "The Poetry Card Contest is open to all students.  You must submit an original poem on a topic of your choice in order to be considered for this award."}, {"Deadline: ": "November 01, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Money Metals Exchange", "Website: ": "", "title": "Money Metals Exchange Scholarship", "id": 168560, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "5", "Amount: ": "Up to $2,000", "Description: ": "The Money Metals Exchange Scholarship is open to high school seniors, undergraduate and graduate students.  You must demonstrate an interest in economics and submit an essay of roughly 1,000 words that answers one of the four questions posed on the sponsor's website in order to qualify for this award."}, {"Deadline: ": "December 15, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Gannon University", "Website: ": "http://www.gannon.edu/Financial-Aid/Types-of-Financial-Aid/Gannon-Scholarships-and-Awards/", "title": "Presidential Scholarship - Gannon University", "id": 168567, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "10", "Amount: ": "100% of tuition", "Description: ": "The Presidential Scholarship is available to entering freshmen at Gannon University.  You must be among the top 10 percent of accepted students in order to be invited to compete for this scholarship."}, {"Deadline: ": "December 31, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Tobi", "Website: ": "http://www.tobi.com/#scholarship_program", "title": "Tobi Cares Scholarship", "id": 168569, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "1", "Amount: ": "$3,000", "Description: ": "The Tobi Cares Scholarship is available to female undergraduate students.  To be considered, you must answer each of the following questions in 200 words or less:  How has your personal style shaped the way you approach and view success?  Describe your career aspirations and your educational plans to meet these goals.  Why are you a good candidate to receive this award?"}, {"Deadline: ": "October 24, 2016", "Type of Award: ": "Promotion", "Provided By: ": "DeVry University", "Website: ": "https://ad.doubleclick.net/ddm/clk/308954981;136498886;j", "title": "College Completer Scholarship", "id": 168577, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "Unspecified", "Amount: ": "Up to $18,000", "Description: ": "You worked hard to get this far, get the credit you deserve. DeVry will help you maximize your qualifying transfer credits so your hard work can be worth it.  At DeVry, we want to help you build on what you’ve done and reach for what you want. Our student support team is here to make it easier to transfer your qualifying credits, and with our College Completer Scholarship, you could receive up to $18,000* to help you earn your bachelor's or associate degree. To be eligible for this merit-based scholarship, you need: 10 qualifying credit hours from another institution and a minimum cumulative GPA of 2.5 or higher.  Find out how we can help you complete your Bachelor’s degree at devry.edu/scholarship.\r\n"}, {"Deadline: ": "October 24, 2016", "Type of Award: ": "Promotion", "Provided By: ": "DeVry University", "Website: ": "https://ad.doubleclick.net/ddm/clk/303179872;130351493;e", "title": "DeVry University Scholarship and Grant for Bachelor’s Degrees", "id": 168578, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "Unspecified", "Amount: ": "Up to $25,000", "Description: ": "Earning a college degree takes a lot of determination and effort. At DeVry University, we’re committed to recognizing your achievements and rewarding your hard work – from day one to graduation day.\r\nIntroducing the DeVry University Scholarship and Grant, created on the belief that every DeVry student deserves help getting started and motivation to keep going strong. With this tiered award program, as your DeVry GPA grows, so does your scholarship.  All new degree-seeking undergraduate students with a GPA of 2.0 or above are eligible. The higher the cumulative grade point average (CGPA), the larger the award amount may be. Per semester, a student with full time enrollment could earn $1,000 with a 2.0 GPA and up to $2,500 with a 3.25 GPA or higher.  Not every university does this, but we aren’t every university. Be recognized for your performance and rewarded for your persistence with the DeVry University Scholarship and Grant. \r\n\r\n\r\n\r\n"}, {"Deadline: ": "September 29, 2016", "Type of Award: ": "Promotion", "Provided By: ": "ScholarshipOwl.com", "Website: ": "http://oasc18.247realmedia.com/RealMedia/ads/click_lx.ads/us.fastweb.analytics/8259449588/x92/Monster/2029143_DatabaseListingOASTracker_ScholOwl_Mar2016/2029143_DatabaseListingOASTracker_ScholOwl_Mar2016/1?", "title": "$1,000 You Deserve It Scholarship", "id": 168581, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "12", "Amount: ": "$1,000", "Description: ": "The 'You Deserve It!' no-essay Scholarship from ScholarshipOwl awards $1,000 and takes only one minute to register. Without any further effort, you can apply to hundreds more scholarships automatically. Apply to scholarships without having to fill out repetitive application forms one application at a time. Why spend hours applying to one scholarship when you can apply to hundreds at the same time! \r\nOn top of that, get automatically reapplied every time a scholarship renews.\r\nScholarshipOwl is the only scholarship service helping you by automating the actual registration process for you. You can also get help from an account manager to help you with your applications, essays, and find more scholarships tailored for you. Don't wait, sign up now and be part of the future of scholarship applications today!\r\n\r\n"}, {"Deadline: ": "September 30, 2016", "Type of Award: ": "Promotion", "Provided By: ": "Fastweb Sweepstakes", "Website: ": "http://www.fastweb.com/content/refer-a-friend", "title": "Fastweb Invite a Friend Sweepstakes", "id": 168582, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "2", "Amount: ": "$500", "Description: ": "The Fastweb Invite a Friend Sweepstakes is open to registered Fastweb members who are legal residents of the 50 United States and the District of Columbia, and who are at least thirteen (13) years of age.  You must log into your Fastweb account to obtain your personal referral link.  For each person who registers for Fastweb via your personal referral link during the Promotion Period, you and your referral will entered as a pair into the monthly drawing."}, {"Deadline: ": "November 01, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Eastfield College", "Website: ": "http://www.foundation.dcccd.edu/myscholarships", "title": "Drs. Richard J. and Carol L. Cinclair Endowed Scholarship", "id": 168583, "Fields of Study: ": "Social Work", "Awards Available: ": "Unspecified", "Amount: ": "$300", "Description: ": "The Drs. Richard J. and Carol L. Cinclair Endowed Scholarship is available to students at Eastfield College.  You must be majoring in social work / substance abuse counseling and have a minimum 2.0 GPA to be eligible for this award."}, {"Deadline: ": "September 30, 2016", "Type of Award: ": "Promotion", "Provided By: ": "Niche", "Website: ": "http://oasc18.247realmedia.com/RealMedia/ads/click_lx.ads/us.fastweb.en/pixel/1838228425/x95/Monster/Cons_FW_Database_Click_Tracker_Oct/6401864/1", "title": "Niche $2,000 No Essay Scholarship", "id": 168584, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "1", "Amount: ": "$2,000", "Description: ": "We know you are busy and we know that times are tough.  That is why we decided to create the easiest possible scholarship to give something back to students.  Students can use the money to help cover tuition, housing, meal plans, books, computers, or any education-related expenses.  The scholarship is open to all high school and college students and those planning to enroll in the next 12 months."}, {"Deadline: ": "September 30, 2016", "Type of Award: ": "Promotion", "Provided By: ": "VIP Voice", "Website: ": "http://oasc18.247realmedia.com/RealMedia/ads/click_lx.ads/us.fastweb.analytics/0359643024/x92/Monster/2000303023-1_Cons_ClickTracker_DatabaseListing/2000303023-1_Cons_ClickTracker_DatabaseListing/1?", "title": "$5,000 VIP Voice Scholarship", "id": 168585, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "1", "Amount: ": "$5,000", "Description: ": "Think you can’t afford to pay for that college or university you’ve always wanted to go to? Let us help. Join VIP Voice today and enter for a chance to win our $5k Scholarship. You pick the school, we’ll help you pay.  As the winner, you’ll be able to put this cash towards to the school of your choice. Enter your points today for a chance to win! Prize will be awarded in the form of a check.\r\n"}, {"Deadline: ": "November 01, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Mountain View College", "Website: ": "http://www.foundation.dcccd.edu/myscholarships", "title": "Mrs. Wilson Shoellkopf, Sr. Memorial Endowed Scholarship", "id": 168586, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "Unspecified", "Amount: ": "$150", "Description: ": "The Mrs. Wilson Shoellkopf, Sr. Memorial Endowed Scholarship is available to students at Mountain View College.  You must be enrolled in a sophomore - level English course, and have a minimum 3.0  GPA to be eligible for this award."}, {"Deadline: ": "November 01, 2016", "Type of Award: ": "Scholarship", "Provided By: ": "Richland College", "Website: ": "http://www.foundation.dcccd.edu/myscholarships", "title": "Tony Latosky Memorial Endowed Scholarship", "id": 168587, "Fields of Study: ": "All Fields of Study", "Awards Available: ": "Unspecified", "Amount: ": "$250", "Description: ": "The Tony Latosky Memorial Endowed Scholarship is available to students at Richland College.  You must be enrolled in and have completed at least one computer networking course with a minimum 2.0 GPA to be eligible for this award."}]